app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-05-19 16:45:15.785575"], ["updated_at", "2015-05-19 16:45:15.785575"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 2], ["created_at", "2015-05-19 16:47:24.541230"], ["product_id", 2], ["updated_at", "2015-05-19 16:47:24.541230"]]
UPDATE "line_items" SET "quantily" = ?, "updated_at" = ? WHERE "line_items"."id" = 1  [["quantily", 2], ["updated_at", "2015-05-19 17:07:02.896450"]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save